app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2023-08-23 10:38:20.125760"], ["status", "public"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)